alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n"I don\'t much care where ——" said Alice.\n"Then it doesn\'t matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'

print('\ntask 01-03 ----------------------------------------------------')
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та екрануйте всі символи одинарної дужки у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"'
                       '\n"That depends a good deal on where you want to get to," said the Cat.'
                       '\n"I don\'t much care where ——" said Alice.'
                       '\n"Then it doesn\'t matter which way you go," said the Cat.'
                       '\n"—— so long as I get somewhere," Alice added as an explanation.'
                       '\n"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."')
print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
print('\ntask 04 ----------------------------------------------------')
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea = 436402
print('Площа Чорного моря становить - ', black_sea, ' км2')
azov_sea = 37800
print('площа Азовського моря становить - ', azov_sea, ' км2')
print('Яку площу займають Чорне та Азов-ське моря разом?')
#print("Розв'язок:")
sum_black_azov_sea = black_sea + azov_sea
print('Розв\'язок: площа Чорного та Азов-ського моря разом = площа Чорного моря + площа Азовського моря = ', black_sea, '+', azov_sea, '=', sum_black_azov_sea, '(км2)')
#print(sum_black_azov_sea)
print('Відповідь:', sum_black_azov_sea, 'км2 площа Чорного та Азовського моря разом')

print('\ntask 05 ----------------------------------------------------')
# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""

products_all=375291
print('на трьох складах - ',products_all,'товарів')
products_st1_st2=250449
print('на першому та другому складі - ',products_st1_st2,'товарів')
products_st2_st3=222950
print('на другому та третьому складі - ',products_st2_st3,'товарів')
print('Знайдіть кількість товарів, що розміщені на кожному складі.')
print("Розв'язок: введемо позначення"
      "\nx - товарів на першому складі"
      "\ny - товарів на другому складі"
      "\nz - товарів на третьому складі")
print('Складемо систему рівнянь:'
      '\nx + y + z = 375291'
      '\nx + y = 250449'
      '\ny + z = 22950')
print('з другого рівняння знайдемо x, з третього рівняння знайдемо z  і підставимо їх в перше рівняння щоб знайти y')
print('x = ', products_st1_st2, '- y')
print('z = ', products_st2_st3, '- y')
storage_2 = products_st1_st2 + products_st2_st3 - products_all
print('y = ', products_all, '- x - z = ', storage_2)
print('тепер y підставимо в рівняння 2 і 3 щоб знайти x i z')
storage_1 = products_st1_st2 - storage_2
print('x = ',products_st1_st2,'-', storage_2,'=',storage_1)
storage_3 = products_st2_st3 - storage_2
print('z = ',products_st2_st3,'-', storage_2, '=',storage_3)
print('вертаємось до позначень і отримуємо')
print('Відповідь:', '\n', storage_1, 'кількість товарів на першому складі,',
      '\n', storage_2, 'кількість товарів на другому складі,',
      '\n', storage_3, 'кількість товарів на третьому складі,')

print('\ntask 06 ----------------------------------------------------')
# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
print('Михайло разом з батьками вирішили купити комп’ютер, скориставшись послугою "Оплата частинами".',
      '\nВідомо, що сплачувати необхідно буде півтора року по 1179 грн/місяць.'
      '\nОбчисліть вартість комп\’ютера.')
print('\nРозв\'язок:')
#print('комп\'ютер сплачувати необхідно півтора року 1179 грн/місяць.')
count_month = 18
print('кількість місяців для сплати = ', count_month)
sum_per_month = 1179
print('сума за місяць для сплати = ', sum_per_month, 'грн')
computer_cost = count_month * sum_per_month
print('Вартість комп’ютера = кількість місяців для сплати * сума за місяць для сплати = ', computer_cost, '(грн)')
print('Відповідь:', computer_cost, 'грн повна вартість комп’ютера')

print('\ntask 07 ----------------------------------------------------')
# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""

a = 8019 % 8
print('остача від ділення 8019 на 8 буде = ', a)
b = 9907 % 9
print('остача від ділення 9907 на 9 буде = ', b)
c = 2789 % 5
print('остача від ділення 2789 на 5 буде = ', c)
d = 7248 % 6
print('остача від ділення 7248 на 6 буде = ', d)
e = 7128 % 5
print('остача від ділення 7128 на 5 буде = ', e)
f = 19224 % 9
print('остача від ділення 19224 на 9 буде = ', f)

print('\ntask 08 ----------------------------------------------------')
# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
print('Іринка склала список замовлення до дня народження:'
      '\nПіца велика - 4шт по 274 грн'
      '\nПіца середня - 2шт по 218 грн'
      '\nСік - 4шт по 35 грн'
      '\nТорт - 1шт по 350 грн'
      '\nВода - 3шт по 21 грн'
      '\nСкільки грошей знадобиться для даного замовлення.')
print('\nРозв\'язок: шукаємо суму по кожному продукту і загальну суму вартості всіх продуктів')
pizza_large_cost = 274
pizza_large_count = 4
pizza_average_cost = 218
pizza_average_count = 2
juice_cost = 35
juice_count = 4
cake_cost = 350
cake_count = 1
water_cost = 21
water_count = 3
pizza_large = pizza_large_cost * pizza_large_count
print('Загальна вартість великих піц = вартість однієї штуки * кількість = ', pizza_large, 'грн')
pizza_average = pizza_average_cost * pizza_average_count
print('Загальна вартість середніх піц = ', pizza_average, 'грн')
juice = juice_cost * juice_count
print('Загальна вартість сочків = ', juice, 'грн')
cake = cake_cost * cake_count
print('Загальна вартість тортів = ',cake, 'грн')
water = water_cost * water_count
print('Загальна вартість води = ',water, 'грн')
total = pizza_large + pizza_average + juice + cake + water
print('Загальна вартість всіх продуктів = ',total)
print('Відповідь:',total, 'грн грошей знадобиться для даного її замовлення')

print('\ntask 09 ----------------------------------------------------')
# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
print('Ігор займається фотографією і він вирішив зібрати всі свої 232 фотографії та вклеїти в альбом'
      '\nНа одній сторінці може бутирозміщено щонайбільше 8 фото.'
      '\nСкільки сторінок знадобиться Ігорю, щоб вклеїти всі фото?')
print('\nРозв\'язок:')
photo_count = 232
print('Загальна кількість фотографій = ', photo_count)
count_per_page = 8
print('Максимальна кількість фотографій на одній сторінці = ', count_per_page)
page_count = photo_count // count_per_page
print('потрібно порахувати кількість сторінок по 4 плюс сторінку, якщо будуть ще фотографії менше 4')

if(photo_count % count_per_page != 0):
      page_count=page_count+1
      print('Загальна кількість сторінок =', page_count)
else: print('Загальна кількість сторінок = загальна кількість фотографій / максимальна кількість фотографій на одній сторінці =', photo_count, '/', count_per_page, '=', page_count)

print('Відповідь:', page_count, 'сторінок знадобиться Ігорю щоб вклеїти всі фото')

print('\ntask 10 ----------------------------------------------------')
# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""

print ('Відстань між містами становить 1600 км.')
distance = 1600
print('на кожні 100 км необхідно 9 літрів бензину')
gasoline_way = 100
gasoline_consumption = 9
print('Місткість баку становить 48 літрів.')
car_tank = 48
print('\n1) Скільки літрів бензину знадобиться для такої подорожі?')
print('Розв\'язок:')
gasoline_consumption_count = distance / gasoline_way
print('Шукаємо скільки частин по 100 км має подорож = відстань між містами / 100 = ', distance, '/ 100 =', gasoline_consumption_count )
gasoline_all = gasoline_consumption_count * gasoline_consumption
print('Шукаємо загальну кількість бензину, яку потрібно для подорожі = кількість кусків по 100 * на кількість бензини, яка йде на 100 км =',gasoline_consumption_count, '*', gasoline_consumption, '=',  gasoline_all)
print('Відповідь:',gasoline_all, 'літрів бензину знадобиться для подорожі')
print('\n2) Скільки разів необхідно заїхати на заправку?')
zapravka = gasoline_all/car_tank
print('Загальну кількість бензину, яка йде на подорож / об\'єм баку = ',gasoline_all, '/', car_tank, '=', zapravka )
print('Відповідь:',zapravka, 'рази необхідно заїхати на заправку')
